rae_rcf/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1; 

boundaryField
{
    
    side1
    {
        type            empty;
    }
    
    side2
    {
        type            empty;
    }
    
    outFlow
    {
        type            zeroGradient;
    }
    
    airfoil
    {
        type            zeroGradient;
    }
    
    inFlow
    {
        type            inletOutlet;
	inletValue	uniform 1;
    }
}


// ************************************************************************* //
