rae_rcf/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{

    side1
    {
        type            empty;
    }

    side2
    {
        type            empty;
    }

    outFlow
    {
        type            zeroGradient;
    }

    airfoil
    {
        type            fixedValue;
	value 		uniform 1;
    }

    inFlow
    {
        type            inletOutlet;
	inletValue 	uniform 1;
    }
}

// ************************************************************************* //
